adding-syntax-extensions-to-an-ocaml-project.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2017-03-04 Sat 00:18 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Adding Syntax Extensions To An OCaml Project</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Bryan Garza">
<meta name="description" content="How to start using syntax extensions"
>
<meta name="keywords" content="ocaml, syntax extensions, oasis">

<link href="https://fonts.googleapis.com/css?family=Source+Code+Pro" rel="stylesheet" type="text/css">
<link href="./css/styles2.css" rel="stylesheet">
<link rel="stylesheet" type="text/css" href="./css/styles.css"/>
</head>
<body>
<div id="preamble" class="status">
<h1 class="title"><a href="http://bryangarza.github.io">Bryan Garza</a></h1>
</div>
<div id="content">
<p>
<div class="outline-3"><h3><a href="./adding-syntax-extensions-to-an-ocaml-project.html"> Adding Syntax Extensions To An OCaml Project</a><span> </span><span class="timestamp-wrapper"><span class="timestamp">( February 8, 2016)</span></span></h3>
</p>

<p>
Here&rsquo;s the set of steps needed to start using syntax extensions. I&rsquo;ll be using
<a href="https://github.com/janestreet/sexplib">sexplib</a> as the example.
</p>

<p>
First, you have to add the extension to your <code>.merlin</code> file:
</p>
<pre class="example">
PKG core yojson lwt cohttp cohttp.lwt
EXT sexplib.syntax
</pre>

<p>
Now Merlin&rsquo;s minor mode won&rsquo;t throw up errors when you save. Next up is
compiling the project. I&rsquo;m using <a href="http://oasis.forge.ocamlcore.org/">Oasis</a>. Add <code>sexplib</code> and its <code>.syntax</code> file to the
<code>BuildDepends</code> in the <code>_oasis</code> file:
</p>

<pre class="example">
(other stuff)

Executable myprogram
  Path: src
  BuildTools: ocamlbuild
  MainIs: main.ml
  CompiledObject: best
  BuildDepends:
    core,
&gt;   sexplib,
&gt;   sexplib.syntax,
    threads,
    yojson,
    lwt,
    cohttp,
    cohttp.lwt
</pre>

<p>
After that, call <code>oasis</code> to add in the new dependencies. I use
</p>
<pre class="example">
oasis setup -setup-update dynamic
</pre>

<p>
Run <code>make</code> again, and the project should build using <code>sexplib</code>!
</p>
</div>
<div id="postamble" class="status">
<a href="archive.html">Archive</a>
</div>
</body>
</html>
